# Создать калькулятор для работы с рациональными и комплексными числами, организовать меню, добавив в нее систему логирования


####################
# Комплексные числа:
from fractions import Fraction


a = 2 +2j
b = 3 + 4j

print(a + b)


####################
# Рациональные числа:
from fractions import Fraction

a = Fraction(5, 8)
b = Fraction(2, 6)

print(a + b)